Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Boyfriend Makeover.tmx
Source language: ko_kr
Languages: en_us

source: 쇼, 쇼핑…?
en_us: shop...ping?

source: 시아쨩!!!
en_us: sia-chan!!!

source: ~ 시아의 셀카찍기 루틴 ~
en_us: sia’s selfie routine

source: 샤이닝 스타 버블스타!!
en_us: shining star! bubble star!!!

source: 뒤뜰이라면...
en_us: the back yard...?

source: 당분간은 SNS 좀 줄여!!!
en_us: stay away from social media for the time being!!!

source: 열심히들 떠드는구만~
en_us: girls just can’t resist gossiping, huh? geez.

source: 여기서 더 큰 변화가 생긴다고…
en_us: I’ll change even more than this...?

source: 골격근/지방 분석
en_us: Muscle/Fat Analysis

source: 어둑 어둑
en_us: CHIRP CHIRP

source: 김민호의 과거사진이라...
en_us: hehe, let’s see...

source: 자, 오늘 우리반에 전학생이 왔어요~
en_us: hey, kids! we have a new student in our class!

source: 4개 1000원
en_us: 4 for a dollar

source: 영상에서 봤던 것보다는 살이 많이 빠진 것 같긴 한데...
en_us: it seems like he lost more weight than what was shown in his video...

source: 백시원은 뭘 입혀도 잘 어울려서 몰랐어…
en_us: I never knew because siwon looked good in everything...

source: 내가 왜?
en_us: why would I?

source: 시원씨, 의상 반납할게요!!
en_us: siwon, let’s return your outfit!

source: 왜 이제 왔어, 보고 싶었다구우!!
en_us: why’d you only come now? I missed youuu!!!

source: 이이익!!!
en_us: ooowww!!!

source: 산책 좀 다녀오고…
en_us: after I take a walk...

source: 저, 저 쪽 방이랄까...
en_us: th-the room over there... maybe...

source: 더, 더 이상…!!
en_us: I-I can’t...

source: 봉인!
en_us: locked away!

source: 분명 초딩땐 덕후는 아니었던 거 같은데…
en_us: you weren’t an anime geek back in elementary school...

source: 쟤네들 지금 무슨 얘길 하는 거야...?
en_us: what are they talking about?

source: [헬스로그] 윤시아의 남자, 관리 시작합니다.
en_us: [Gym Vlog] Sia Yoon’s Boyfriend Starts Working Out!

source: 삐쩍 말라서는...
en_us: he’s too skinny...

source: 다이어트 방법 바꾸면 안 될까요?
en_us: can’t we change his diet a bit?

source: 갑자기 역변해서 그렇지...
en_us: I don’t know how he turned into this, though...

source: 그렇다고 해도 3주만에 4키로 감량은 정말 대단한 거야!
en_us: besides, losing nine pounds in three weeks is still really great progress!

source: 내가 미쳤거나 둘 중 하나다.
en_us: ...or I have.

source: 안 사요!!
en_us: no thank you!!!

source: 김민호 이 녀석…
en_us: this kid, minho...

source: 시아가 있으니까!!
en_us: ...think of sia!!!

source: 前 50만 뉴투버 윤시아와
en_us: the story of sia yoon, a newtuber with half a million subscribers...

source: 실내 흡
en_us: Smoking ind

source: 나랑 함께 하고 싶은 콘텐츠가 있다며?
en_us: you said you wanted to do a collab with me.

source: 오이오이!
en_us: oy, oy!

source: 익명 18
en_us: Anonymous 18

source: 기념 영상도 찍어야겠다!
en_us: I’ll film our date to celebrate that while we’re at it!

source: 마지막 룩은,
en_us: on to the last outfit!

source: 썸네일에 김민호 걸어놓기만 해도 어그로 겁나 잘 끌릴 걸?
en_us: just putting minho’s picture on your thumbnail will be really effective clickbait!

source: 구질 구질한 건 없단 말이야...
en_us: ...sucks more than anything else.

source: 16화
en_us: Episode 16

source: 이번에는 프로그램에 서킷 트레이닝을 추가했어.
en_us: I added circuit training to his routine.

source: 기억났어요!
en_us: I remember!

source: 난 초대형 뉴튜버가 될 거니까!
en_us: why? because I’m going to be a superstar newtuber!

source: 어떻긴, 민호가 정말 잘 따라줘서 내가 더 고마울 정도야.
en_us: he did so well that I’m actually really grateful.

source: 1시간 전
en_us: 1 hour ago

source: 내 몸을 좀 봐...
en_us: just look at this belly...

source: 간식 먹고 힘내, 너 그렇게 우울해 하는 거 안 어울리니까.
en_us: have these snacks and cheer up. it isn’t like you to be so depressed.

source: 이거 몰래카메라 콘텐츠지!?
en_us: you’re filming a prank for our channel, right?

source: 나는 이별을 인정하고 현실을 받아들이기로 마음 먹었다.
en_us: ...I decided to acknowledge it and accept reality.

source: 그래도 그만 뛰고 싶어?
en_us: are you sure you want to stop running?

source: 좔좔 흐르는 귀티 덕에 엄청난 인기를 끌고 있다.
en_us: he just oozes elegance, which contributed to our channel’s incredible success.

source: 헬스장에 처음 와보니까 어때?
en_us: how was your first visit to a gym?

source: 참된 자세야!
en_us: it’s a good thing!

source: 아오, 이놈의 벽지 당장 뜯어버리고 싶네!!
en_us: ugh! I want to get rid of this wallpaper!!!

source: 시아루~ 시시커플의 시아입니다!
en_us: hello, my sialoves! sia of the sisi couple here!

source: 너…
en_us: you...

source: 충성!
en_us: salute!

source: 오오, 잘 나온 거 같은데 잉스타 스토리 올릴까?
en_us: oooh! this one came out great! should I post it to my stories?

source: 설명 타임...
en_us: after the long explanation...

source: ...젠장!
en_us: dammit!

source: 민호의 뷰티 코치가 돼서 킹카 만들기 프로젝트를 도와달라 이거지?
en_us: ...you want me to be minho’s beauty coach... and help you with your project to turn him into a stud?

source: 윤시아 단독 콘서트에 온 것 같은 기분인걸…?
en_us: it feels like we’re at sia’s solo concert or something...

source: 제가 이 녀석을!!
en_us: I’m going to transform him...

source: 갑자기???
en_us: suddenly???

source: 파앗
en_us: ZIP

source: 수타킹 CBS
en_us: StoreKing CBS

source: 오빠를 훈남으로 만드는 프로젝트를 한다구요!?
en_us: a project to turn minho into a stud?!

source: 이거 구하기도 힘든 거라 들었는데...
en_us: I heard that’s really difficult to get...

source: 구독자 47,8만명
en_us: 478k subscribers

source: 소스는 양심껏 적게 찍어서 먹고~
en_us: hold back a bit on the sauce too.

source: 먹고 싶어…!
en_us: I want to eat it all so badly!

source: 여행이라도 갔어야 했는데 ㅠㅠㅠ
en_us: we should have gone on a trip somewhere...

source: 재밌겠지?
en_us: doesn’t it sound fun?

source: 누가 이런 장난을...!
en_us: who dared to pull a prank on me?!

source: 수많은 인플루언서들이 팔로우 되어 있다.
en_us: ...whom she doesn’t follow with her public account.

source: 뭐, 뭐라고...?!
en_us: wh-what?!

source: 으으…
en_us: ugh...

source: 어디긴,
en_us: duh.

source: 너 햄버거 먹다 들켰다며!!!
en_us: I heard you got caught eating a burger!!!

source: 왜, 왜…?
en_us: wh-why?

source: 나코만 있으면 현실 세상은 필요 없어!!!
en_us: as long as I have nako, I don’t need anything from the real world!!!

source: 오옷
en_us: WHOA

source: 모델같은 훤칠한 피지컬
en_us: he looks like he could be a supermodel too!

source: 미안한 마음이 커진다.
en_us: ...makes me feel bad.

source: 나도 몰라!!
en_us: whatever!!!

source: 너 오늘 ㅈ된줄 알아라.
en_us: you’re screwed now.

source: 아이돌인줄 알았어~
en_us: I thought you were an idol singer or something!

source: 노!
en_us: no!

source: 야, 몸 좀 숙여봐.
en_us: hey, can you bow your head down for a moment?

source: 얼른 나코짱 포스터도 떼고!!
en_us: I need to pull down all my nako-chan posters!!!

source: 섯끼츄가 부활했어!
en_us: setkichu came back to life!

source: 내 눈엔 그 모습마저 섹시해!!!
en_us: ...but even that is super sexy!!!

source: 예약취소
en_us: Cancel reservation

source: 내가 깨우기도 전에 등교했다고!?
en_us: he left for school before I woke him up?!

source: 얘는 왜 날 이런 곳에 데려온 거야!!
en_us: why’d he tell me to come to a place like this?!

source: 자, 팝콘 사러 가자.
en_us: let’s go get some popcorn.

source: 찌잉~
en_us: TEARY

source: 네가 카운터 길막을 하고 있는데 나보고 어쩌라고~
en_us: you were blocking the counter. what else am I supposed to do?

source: 시아쨩이 생각보다 너무 일찍왔어...!!
en_us: sia-chan arrived a lot sooner than I expected!!!

source: 어딜가나 주목을 받는 건 나였단 말야!!!
en_us: all this attention is supposed to be mine!!!

source: 아주 온 가족들한테 소문을 다 내놨구만...
en_us: he told the whole family!

source: 혹시 무슨 일로...
en_us: what brings you... here?

source: 어… 오늘 되게 여, 열심히 달렸나보네…
en_us: uh... you must have run r-really hard...

source: 엉엉엉
en_us: SOB SOB SOB

source: 시, 시아쨩...
en_us: s-sia-chan...

source: 나코땅 귀여워~
en_us: nako-chan’s so cute!

source: 방해될까봐 끝날 때까지 기다렸지~
en_us: I didn’t want to interrupt, so I waited until you finished.

source: 여친이라도 생김?
en_us: got a girlfriend or something?

source: 울먹
en_us: TEARY

source: 둥!
en_us: DUN

source: 아니, 뭐 여기까진 괜찮은데...
en_us: I mean, well, it’s fine up until this point...

source: 우리 데이트 브이로그 안 올라간지 꽤 됐단 말야~
en_us: it’s been a while since we’ve uploaded a date vlog, too!

source: 파티잖냐.
en_us: because it was a party.

source: 지존나코땅
en_us: [Nako-chan Lover]

source: 다행이당!!
en_us: that’s a relief!!

source: 어...?
en_us: huh?

source: 그게 이유야!
en_us: that’s my reason!

source: *애니덕후 이력 有
en_us: *used to be an anime geek

source: 아빠 기억속 민호
en_us: dad’s memory of minho

source: 생각보다 귀엽다!!!
en_us: that’s cuter than I expected!!!

source: 아냐, 내가 미쳤지...
en_us: no, no... I can’t resort to him...

source: 이 새X가!
en_us: this b*tch!

source: 물심양면으로...
en_us: ...everything.

source: 알았다!
en_us: I get it!

source: 천사같은 우리 시아쨩을...!!!
en_us: ...even think of doing that to my angelic sia-chan!!!

source: 헤에...!?
en_us: eeeh?

source: 어때요?
en_us: how does this look?

source: 아직 많이 배워야죠.
en_us: but I still have a lot to learn.

source: 이, 이제 끝난 거지...?
en_us: w-wrap up now?

source: 내가 어리석었어…!
en_us: how foolish of me!

source: 24시이사24 040
en_us: EZ Move 040

source: 과거 인기 TV 프로그램에 출연한 태권도 신동 출신이었거든!
en_us: ...went on a famous show as a taekwondo prodigy when I was a little kid!

source: -아, 안돼..!
en_us: N-no!

source: 자아, 그럼 이대로 30kg만 더 빼는 거야!!!
en_us: great! let’s lose 50 more pounds now!!!

source: 오빠 깨워야 되는데...!!
en_us: gotta wake minho up!

source: 엄기덕 3개월 전
en_us: Gideok Eom 3 months ago

source: 노래 nekoneko
en_us: Song: nekoneko

source: 그거 조회수 쩔더라..
en_us: it’s been getting tons of views...

source: 깔끔하게 좀 입고 다니고~
en_us: you should keep yourself neat and tidy too!

source: 잠깐만...
en_us: wait...

source: 거북칩 뿡이요 축축 쿠키
en_us: Turtle Chips PUFF Chips ChookChook Cookies

source: 곧 효주도 온대!
en_us: hyoju’s coming soon too!

source: 말도 안 돼…!!
en_us: no way!!!

source: 끄으으윽...
en_us: aaagh...

source: 왜 더 찐 거야!?
en_us: why is he heavier?!

source: 실시간 스트리밍 중
en_us: Streaming Live

source: 인생 처음으로 남자한테 차였다!
en_us: ...got dumped for the first time in my entire life!

source: 앞으로도 꾸준히 루틴 유지하면 정상체중까지 금방 갈 수 있을 거야.
en_us: if you keep it up like this, you’ll be at a normal body weight in no time.

source: 짱라면
en_us: Yummy Noodles

source: 제발 다시 한 번만 생각해주라!!!
en_us: please think it over! just once!!!

source: 배달주문 0*7-5**1-2**5
en_us: Delivery 0*7-5**1-2**5

source: 이런 대존잘 남칭이랑 모태 깜찍이인 내가 찍는 영상인데
en_us: with videos of a superstud boyfriend like him and a natural-born cutie like me...

source: *버피 테스트중
en_us: *doing burpees

source: 따뜻하고 편한 느낌의,
en_us: a warm and easy-going...

source: 힘이 들고 외로울 땐!
en_us: when you feel lonely and down!

source: 얘를 집에 데려가자고…?
en_us: bring minho to our house?

source: 그럼 지금 잠깐 나올래?
en_us: hey, do you want to come out for a bit?

source: 자-
en_us: well, then.

source: 알았어엉...
en_us: okaaay...

source: 뭔가 이상한 점이 있었어.
en_us: there was something strange.

source: 노크하시오!
en_us: Please knock!

source: 내가 시키는대로 했다는 거!?
en_us: you really did everything as I said?!

source: 어, 그래서 김민호 걔 얼굴 볼 때마다 미안해 죽겠어.
en_us: yeah... I feel really bad every time I see him.

source: 머쓱
en_us: SCRATCH

source: 특히 민호 반응 엄청 좋던데?
en_us: people are responding really well to minho too!

source: 민호쿤!!!?
en_us: minho-kun?!!!

source: 안녕하세요!
en_us: hello!

source: 뭐든지 시켜만 줘!!!
en_us: please use me!!!

source: 있었다!!!
en_us: ...my hidden gem!!!

source: ㅋㅋㅋ 꿀잼 언넝 잘생겨진거 보고싶다
en_us: lol i want to see how handsome he is already

source: 알았어,
en_us: okay!

source: 그래~ 저거 지금 질투나서 그러는 거야.
en_us: yeah, she’s just jealous of you.

source: 힘들게따.
en_us: it looks hard...

source: 그리고 마구 흔들어!!!
en_us: and shake it hard!!!

source: 그래, 맞아!
en_us: yeah, that’s right!

source: 그렇게 하면 다친다니까!!
en_us: you’ll get hurt like that!

source: 너 그거 반만 먹고 나 줘야한다?
en_us: you’d better eat only half and give me the rest!

source: 권구민 삶은....{j}계란...
en_us: Gumin Kwon life is... a lemon...{j}

source: 아침 산책은 정말 재미있어!!
en_us: ...but in the end, I really enjoy these morning walks!!!

source: 언뜻보면 구독자수에 큰 변화는 없지만,
en_us: on the surface, there wasn’t much of a change to the number of subscribers to her channel.

source: 김민호 이 좌식이!!
en_us: minho kim! you moron!!!

source: 어쨌든, 내일부터 새로운 운동도 시작하고 강도도 높여 볼테니까.
en_us: anyway, we’ll start some new workouts tomorrow and increase the intensity.

source: 나도 사실 예전에 그랬잖아…
en_us: ...I used to do the same.

source: 오오~
en_us: oooh!

source: 미안해 나코짱...
en_us: sorry, nako-chan...

source: 니야.
en_us: isn’t.

source: 글쎄, 그건 해 봐야 아는 거지~ 그리고 너 정도면 정체기라기엔 귀여운 편이야.
en_us: well, we’ll have to try to see. and in your case, that’s not really even a plateau.

source: 열받아!!!
en_us: I’m so mad!!!

source: 야 전학생 코 흘린다!!
en_us: hey, the new kid has snot on his face!!!

source: 잠자코 내 말 들으라구!!
en_us: just do as I say!

source: 항상 퀴퀴한 곰팡이 냄새가 나서,
en_us: it smells off musty mold,

source: 아니...
en_us: oh...

source: 시아가 지금 나 지켜주고 있는 거 맞지…!?
en_us: ...but sia’s taking my side right now, right?

source: 아아, 맞아.
en_us: oh, right.

source: 심지어 첫사랑!!??
en_us: your first love?!!!

source: 시아쨩이랑 약속 했었잖아…!!
en_us: I promised sia-chan!!!

source: 오늘 멋있게 하고 가라고~!!!
en_us: dress to impress today!!!

source: 이 캐릭터는 옷을 입은 거야 만 거야?
en_us: what the heck is this character wearing? or not?

source: 우리 둘이 함께하면 뭔가...
en_us: ...that if it’s us two...

source: 7세 태권도 신동녀 근황.{j}INGSTA{j}벌써 이렇게 컸다.{j}05년생이라고...
en_us: 7-year old Taekwondo prodigy is all grown up. Here are her recent Instargram photos. Now a high schooler...{j}{j}{j}

source: 마마
en_us: Mama

source: 그 이유밖에 없어.
en_us: that’s it.

source: 내가 이래서 커플 뉴튜브는 안 봄ㅋㅋㅋㅋ 언제 헤어질지 모르니까
en_us: exactly why i dont watch newtube videos that couples make lol who knows when theyll break up

source: 그 아이의 이름은 윤꽃분이었다.
en_us: her name was daisy yoon.

source: 예휴, 아까부터 계속 풀이 죽어있네 윤시아.
en_us: sia, you’ve been down in the dumps for a while now.

source: 저요?
en_us: meee?

source: 나코니와 민나노 모!
en_us: nakoniwa minano mo!

source: X만한 게 다시는 못 까불게 만들어야지.
en_us: can’t let that little b*tch act up ever again.

source: 명품과 성형을 콘텐츠로 3개월만에 45만 구독자를 찍은 급성장 뉴튜버로...
en_us: her newtube channel, which features content on high-end brands and cosmetic surgery, quickly grew to 450k subscribers in three months.

source: 네가 끌고 온거잖아...
en_us: you’re the one who dragged me here...

source: 어차피 내일 또 빡센 운동 가는 날이고
en_us: besides, tomorrow’s going to be a hard workout.

source: 볼록
en_us: JIGGLE

source: 엉? …
en_us: huh?

source: 윤시아가 왜 여기!!
en_us: why is sia here?!!!

source: 부끄러워...
en_us: don’t embarrass me...

source: 하하하, 너 진짜 나 많이 좋아하는구나?
en_us: hahaha! you really like me a lot, don’t you?

source: 다이어트 식단
en_us: weight loss meal plan

source: 어…
en_us: uh...

source: 남 좋은 일만 하기엔 내가 요즘 너무 바빠져서...
en_us: I’m a bit too busy to volunteer my time and energy...

source: 절대 못 들어가, 집에 갈래!!
en_us: nope. can’t go in there. I’m going home!!!

source: ... ...{j}어...
en_us: {j}uh...

source: 드디어 만식이의 새로운 뉴튜브 콘텐츠가 업로드 되었고,
en_us: mansik uploaded his new video to his channel.

source: 나코짱의 얼굴을 봐도 전처럼 설레지가 않아!!!!!!!
en_us: ...is that my heart doesn’t flutter anymore when I see nako-chan’s face!!!!!!!

source: 이런데도 나코짱 덕질만 하는 게 좋아?
en_us: is nako-chan really worth any of this trouble?

source: 나랑 다른 세계에서 사는 애들 같아.
en_us: it’s like they live in another world.

source: 여태 아무리 좋은 일 해보려 해도 화제 한 번 안 되더니...
en_us: no one ever paid much attention whenever I tried to do good deeds...

source: 나, 나는 어떡해, 시아쨩!!?
en_us: wh-what do I do, sia-chan?!

source: 뭐야~~ 너~
en_us: hey, you!!!

source: 으음~ 맛있어!!
en_us: mmm! so good!!!

source: 난 백시원이랑 헤어졌잖아.
en_us: siwon and I are done.

source: 윤시아, 인생 두번째로 남자에게 차였다!
en_us: sia yoon, dumped again!

source: 두근 두근 두근 두근
en_us: THUMP THUMP THUMP THUMP

source: 잠깐의 휴식기를 가지고 다시 돌아오겠습니다.
en_us: I will return to you with more content after taking a brief break.

source: 역시 근육량이 처참하네...
en_us: as I expected... he barely has any muscle.

source: 날 바라보는 사람들의 시선들...!
en_us: the way people look at me!

source: 샤방~
en_us: BLING

source: 2개월의 공백 기간 동안
en_us: during this two-month break...

source: 또 윤시아 녀석이 굶긴 거냐!?
en_us: did that sia kid starve you again?!

source: 아직 나에겐 너무 과하달까...!!
en_us: is too much for me right now!!!

source: 뭐, 뭐야...!
en_us: wh-what the-!

source: 시도조차도 할 수 없는 거냐구!!
en_us: but I can’t even try?!

source: 만식이의 집중 코치를 받게 되었으며,
en_us: ...all under mansik’s focused coaching.

source: 어때, 보기만 해도 살 빠질 것 같지 않아?
en_us: doesn’t it feel like you’re already losing weight just looking at this?

source: 어어?
en_us: huh?

source: 뭐, 뭐!!?
en_us: wh-what?!

source: 점심 시간 끝나기 전에 보기로 했단 말이야!
en_us: they agreed to see us before lunch is over!

source: 그러니...
en_us: I see...

source: #옐랑말랑 #립틴트8호 #강추 #광고
en_us: #Yellang #liptintno8 #recommended #ad

source: COIN 노래연습장 봄스터치 서울야시장
en_us: COIN Karaoke Bom’s Touch Seoul Bar

source: 퉤
en_us: PTOO

source: 나도 뉴튜브 홀로서기는 처음이라서...
en_us: this is my first time doing newtube on my own, too.

source: 어디 좀 같이 가자?
en_us: come with me, won’t ya?

source: 생각보다 재밌었어.
en_us: it was more fun than I expected.

source: 너도 분명 마음에 들어할 걸?
en_us: I’m positive you’ll like it!

source: 냠냠냠
en_us: NOM NOM NOM

source: 앗, 비공개 계정으로 로그인 돼있었네.
en_us: oh, I logged into my private account.

source: 김민호 녀석...
en_us: minho...

source: 아 미안 까먹었어.
en_us: oh, sorry. I forgot.

source: 이제 그만하지 그래?
en_us: that’s enough, don’t you think?

source: 음냐~
en_us: NOM NOM

source: 좋아요 12,030개
en_us: 12,030 likes

source: 뭐야~!?
en_us: what happened?!

source: 와구
en_us: CHOMP

source: 그야 아빠가 지어준 이름은 구리니까!!
en_us: that’s because the name you gave me sucked, dad!!!

source: 으아, 내 흑역사;
en_us: ack! no! my embarrassing past!

source: 민호킁이 저러고 있는 걸 보니...
en_us: seeing minho-kun like that...

source: 마, 맛있겠다!!
en_us: th-that smells so good!!

source: 네엥~
en_us: yessir!

source: 내가 바로
en_us: that’s me!

source: 저녁 고구마 1개 바나나 1개
en_us: Dinner 1 sweet potato 1 banana

source: 내가 타이밍을 잘못 잡은 것 같아.
en_us: I think I confessed at the wrong time.

source: 큼흠, 당연하지.
en_us: ahem, of course.

source: 히, 히익...
en_us: GASP

source: 그래서 훈남은 어떻게 만들 건데?
en_us: ...but how will you turn him into a stud?

source: 그, 그치만 성환쿤이 분명 데이트가 맞다고 했는 걸…?
en_us: b-but... seonghwan-kun said it’s a date...

source: 어딜 가자고?
en_us: go where?

source: 킹카도 되고 나랑 연애도 하고!
en_us: you can become a stud and have me as your girlfriend!

source: 어때…?
en_us: how do I look?

source: 님들 여기 좀 보세요!!
en_us: hey, everyone! look here!!!

source: 오~
en_us: oh!

source: 잘생겨지고 싶지 않냐고...?
en_us: do I want to be handsome...?

source: 헉, 헉...
en_us: huff... huff...

source: 재미있어 보였어?
en_us: did it seem fun?

source: 힘이 들고 외로울 땐~
en_us: when you feel lonely and down~

source: 키빼몸 110은 진리인 거 몰라!!?
en_us: that’s exactly why! you’ll finally have a normal bmi!

source: 민호 방 투어부터 시~작!!
en_us: ...let’s start with a tour of minho kim’s room!!!

source: 야, 김민호!
en_us: minho kim!

source: 많이 뺐네~
en_us: you lost a lot!

source: 그런데… 민호 화제성이 대박이긴 한가봐~
en_us: but wow... minho’s a really hot topic for sure.

source: 오빠 왔다!
en_us: minho’s back!

source: 사진?
en_us: picture?

source: 영화는 어땠어?
en_us: how was the movie?

source: 분명 꽤 큰 변화가 있을 거야!
en_us: I’m sure there was a huge change!

source: 세-노 데모 손난쟈 다메- (하나 둘 그래도 그러면 안 돼-)
en_us: se-no demo sonanjiya dame- (one, two, but still, don’t do that)

source: 지금까지도 잘 했잖아, 나...
en_us: I’ve been doing well until now... haven’t I?

source: 마디점프 마디점프 일시정지
en_us: Skip measure Skip measure Pause

source: 멘틀스
en_us: mentals

source: 오후 4:13
en_us: 4:13 PM

source: 게임?
en_us: gaming?

source: 몰래 1일 1식 다이어트를 시작했다.
en_us: ...minho secretly started the one meal a day diet.

source: 제이유 다이(어트)
en_us: The J.U. Diet

source: 활 활
en_us: BLAZE BLAZE

source: 메이크업이 호불호가 조금 갈리긴 하지만~
en_us: all despite people being split between loving or hating makeup.

source: 잠깐만, 시원아!!!
en_us: siwon, wait!!!

source: 와!
en_us: wow!

source: 그것도 꽤 오래 전부터...
en_us: I’ve liked you since a long time ago...

source: 아하하…
en_us: ahaha...

source: 추워!!
en_us: it’s cold!

source: 왜, 그 백시원인가 박시원인가 하는 누나 남친이랑...
en_us: you know, your boyfriend. siwon or siwan, whatever his name is...

source: 그럴 리가 없는데…
en_us: no way...

source: 우리 왔다!!!
en_us: we’re here!!!

source: 다행히도 민호는
en_us: fortunately, minho...

source: 트와즈원?
en_us: twize-one?

source: 크윽...!!
en_us: ugh!!!

source: 축하한다, 민호쿤!
en_us: congrats, minho-kun!

source: 백시원이 누군지는 모르겠지만...!!
en_us: I don’t know who siwon is...

source: 가장 좋아하는 애니메이션도 함께 보고,
en_us: ...watch my favorite anime movie with you...

source: 오늘 운동도 힘들텐데… 걱정 돼서~
en_us: today’s workout will be really hard, so I’m a bit worried...

source: 우린 이제 성공이야!!!
en_us: we’re gonna succeed!!!

source: 으, 으으으으...!
en_us: e-errrgh!

source: 너는..!!!
en_us: but you’re-!!!

source: 발걸음은 가벼워졌으며,
en_us: ...and he was lighter on his feet.

source: 그야 네가 날 좋아하니까.
en_us: ...is because you like me.

source: 헤집
en_us: TOSS

source: 만약 제가 도울 것이 있으면 열심히 도울게요...!
en_us: if there’s anything I can help with, I’ll do it!

source: 다.
en_us: ED.

source: 그렇다면 잘 찾아왔다.
en_us: then you’ve come to the right place.

source: 젠장...
en_us: shoot...

source: 버블버블
en_us: Bubbly

source: 아, 뭐야!
en_us: what’s wrong with you guys?

source: 시아랑 네가 이렇게 고생하는데...
en_us: you and sia are working so hard to help me...

source: 내 겨울방학~
en_us: my winter vacation!

source: 이제 전혀 불편하지 않음!
en_us: it isn’t uncomfortable anymore!

source: 아동 만화!?
en_us: a children’s cartoon?!

source: 김도ㅎ
en_us: Doha Kim

source: 어제까지 찍어서 잉스타에 게시하기로 했는데 까먹었네...
en_us: I was supposed to take the picture and post it yesterday, but I forgot...

source: 월화수목금토일
en_us: Mon Tue Wed Thu Fri Sat Sun

source: 며칠 안 본 사이 살이 좀 빠진 것 같은데!?
en_us: you look like you lost some weight the last few days!

source: 사주 2층 타로
en_us: Fortune 2F Tarot

source: 내가 다 먹은 거 같은데...
en_us: I ate almost everything...

source: 히에에에엑!!!
en_us: eeeeek!!!

source: 하하 이 새X가~
en_us: haha, loser.

source: 우리 이제 어디가?
en_us: where are we going now?

source: -넌내거야!-
en_us: You’re mine!

source: 15화
en_us: Episode 15

source: 네 말만 따르면 나도 정말 꽃미남이 될 수 있는 거지...?
en_us: if I just do as you say, I’ll become a stud, right?

source: 이, 이건 그냥 계단에서 굴렀을 뿐야.
en_us: th-this is because... I tripped on the stairs...

source: 화들짝!
en_us: JUMP

source: 3대측정!
en_us: Alex’s Strength Test!

source: 음, 그건...
en_us: um, well...

source: 지금까지 시시 커플의 등교준비 브이로그였습니다!
en_us: thanks for watching the sisi couple’s morning vlog!

source: 그 매점에서 본 오타쿠한테!?
en_us: that otaku we saw at the store?!

source: 겨우 따돌렸다...
en_us: I finally lost her...

source: 야!!
en_us: everyone!!!

source: 생각보다 평범한걸?
en_us: it actually looks normal.

source: 나코짱!!!!
en_us: nako-chan!!!!

source: 뭐야 교실 혼자쓰나...
en_us: ugh, they’re so loud...

source: 나 뉴튜브 진짜 어떡하지...!?
en_us: ...what am I supposed to do about my newtube channel?

source: 우리 같은 오타쿠들은 상처만 받고 끝나버린다고.
en_us: otakus like us will only get hurt.

source: 이런 이미지인가...?
en_us: kind of like this...?

source: 만식이의 규칙을 하나둘씩 어기기 시작했다.
en_us: ...began to break mansik’s rules, one by one.

source: 넷상에서도 핫한 이야깃거리가 되었다.
en_us: ...and became a hot topic all across the internet.

source: 말 하는 걸 보면 시아 친구 같은데...
en_us: it sounded like he’s sia’s friend...

source: 윤시우 이 새ㄲ...
en_us: siu yoon, that little-!!!

source: 다음에 또 만나요!
en_us: see you again with the next video!

source: 니가 나락이라니!
en_us: bobae, don’t mind her!

source: 살이 빠졌다기 보다는...
en_us: I don’t know about weight...

source: 평소대로 끼니를 먹되, 단백질과 채소 위주의 식사를 하였으며,
en_us: minho ate regular meals that were heavier on protein and vegetables...

source: sia**** 모야모야~ 딱 윤시아 립이자너~
en_us: sia**** OMG! This lip tint and I were just meant to be!

source: iambobae*** 외출준비 끝~
en_us: iambobae*** I’m ready to go out today!

source: 한스 왜 이제 왔어ㅏ여ㅠ
en_us: Hans u were away for so looong :(((

source: 느낌이 왔어.
en_us: I got a feeling...

source: 나 여태 고생했으니…!!!
en_us: I’ve worked really hard until now!!!

source: 슥!
en_us: JOLT

source: 이런 얘기 하니까 웃기지만…
en_us: so it might sound funny that I said this...

source: 봄스터치 2F
en_us: Bom’s Touch 2F

source: 그래~ 마음껏 떠들어라~
en_us: whatever. go ahead and sneer at me.

source: 이대로만 성실하게 하면,
en_us: so if you keep going like this...

source: 나, 나보고 어쩌라고!!!
en_us: wh-what am I supposed to do?!!!

source: 이거 뉴튭에 올렸으면 바로 100만 찍는 건데!!
en_us: it would’ve gotten a million views in an instant!!

source: 회원님 나이스~
en_us: you’re doing a good job!

source: 볼살 좀 줄여주고 싶다...
en_us: I want to shave off these cheeks...

source: 애가 묘하게 힘이 없는데…
en_us: he seems kind of low on energy...

source: 나 기다려줘!!!
en_us: wait for me, okay?!!!

source: 너에 대한 믿음도 크게 없어고,
en_us: I didn’t have much faith in you.

source: 최근 들어 꽤 큰 변화를 맞게 되었다.
en_us: ...experienced a huge change recently.

source: 백시원
en_us: Siwon Baek

source: 알겠어, 안 그래도 나도 바꾸려고 했거든...
en_us: okay. I was planning to change it anyway...

source: 난 친구들이랑 항상 이렇게 해왔어서…
en_us: my friends and I always did it this way...

source: 나오는 만화였나…
en_us: mimi-chan or whatever?
